SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-61665

Comment( ******REPORT BASED ADVANCED FEATURES APPLIED******* )

Comment( ************** General Information***************** )
Type ( Engine )
WagonShape ( MCLW_B17_61665.s )
Size  ( 3.123m 3.79m 11.4m )
Mass ( 80.5t-uk )
WheelRadius ( 19.5in )comment (Front Bogie)

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Comment(Stiffness ( 1e7N/m 1e7N/m ))
			Comment(Damping ( 0.2e7N/m 0.2e7N/m ))
			Break ( 710kN 1220kN )
			r0 ( 20cm 0cm )
		)
		CouplingHasRigidConnection (1)
		Comment(Velocity (0.1m/s))
		Comment(CouplingUniqueType (DR_BR_8P_71000))
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Comment(Stiffness ( 1e6N/m 2e6N/m ))
			Comment(Damping ( 1e6N/m 1e6N/m ))
			Break ( 600kN 1000kN )
			r0 ( 20cm 0cm )
			)
	CouplingHasRigidConnection (0)
	Comment(Velocity (-0.1m/s))
	)
	
Comment( ********** Brakes, Type, Force, etc *************** )
BrakeEquipmentType( Vacuum_brake, Auxilary_reservoir )
BrakeSystemType( Vacuum_single_pipe )
MaxBrakeForce( 221kN )
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg )

ORTSNumberBrakeCylinders ( 2 )
Comment ( Assume 1 x 30in vacuum cylinder with 9in stroke )
Comment ( OpenRails assumes 4.5in stroke so this is set as two cylinders )
ORTSBrakeCylinderSize ( 30in )
ORTSAuxilaryResCapacity ( 8.25ft^3 ) Comment ( Based on Phillipson 16.5ft^3 vacuum chamber for 30in x 9in vacuum cylinder )

Brakepipevolume (1.29ft^3 ) Comment (* based on length of loco plus 16 feet for bends, branches and hoses *)

MaxReleaseRate ( 2.5inHg/s ) 
Comment ( use MaxReleaseRate ( 10inHg/s ) for steam braked class V2; MaxReleaseRate ( 2.5inHg/s )for vacuum braked class V2 )

MaxApplicationRate ( 2.0inHg/s )
Comment ( use MaxApplicationRate ( 1.3inHg/s ) for steam braked class V2; MaxApplicationRate ( 2.0inHg/s )for vacuum braked class V2 )

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121) 

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.8m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 15.0ft 0.0in )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )

Comment( CN 1990 DWx18)
ORTSDavis_A ( 5885 )
ORTSDavis_B ( 26.91 )
ORTSDavis_C ( 5.342 )

ORTSWagonFrontalArea (100)
ORTSDavisDragConstant (0.0024)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)

Lights	(	4
		Light	(
			comment( Sphere of light - cab light )
				Type		( 1 )
				Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
			)
				Cycle		( 0 )
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				States	(	1
					State	(
						Duration ( 0.0 )
						LightColour ( 80ffe610 )
						Position ( 0 10.0 -12.00 )
						Transition ( 0 )
						Radius ( 8.0 )
						Angle ( 105.0 )
						)
					)
			)
		Light	(
			comment( Flickering Firebox )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff7200 )
					Position ( -0 2.15 -4.5 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffe610 )
					Position ( -0 2.15 -4.5 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
									
					)
				)
			)
		Light	(
			comment( Flickering front lamp - Position B)
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 2 )
				TimeOfDay ( 0 )
				Weather ( 0 )
				Coupling ( 0 )  
				)
			FadeIn	( 0.75 )
			FadeOut	( 0.75 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.01 )
					LightColour ( ff808000 )
					Position ( 1.0 1.3 5.16 )
					Azimuth ( 0.0 0.0 5.0 )
					Transition ( 0 )
					Radius ( 0.5 )
					Elevation ( 0 0 0 )
					)
				State	(
					Duration ( 0.1 )
					LightColour ( ccdddddd )
					Position ( 1.0 1.3 5.16 )
					Azimuth ( 0.0 0.0 5.0 )
					Transition ( 0 )
					Radius ( 0.5 )
					Elevation ( 0 0 0 )
					)
				)
		)
		Light	(
			comment( Flickering front lamp - Position D)
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 2 )
				TimeOfDay ( 0 )
				Weather ( 0 )
				Coupling ( 0 )  
				)
			FadeIn	( 0.75 )
			FadeOut	( 0.75 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.01 )
					LightColour ( ff808000 )
					Position ( -1.0 1.3 5.16 )
					Azimuth ( 0.0 0.0 5.0 )
					Transition ( 0 )
					Radius ( 0.5 )
					Elevation ( 0 0 0 )
					)
				State	(
					Duration ( 0.1 )
					LightColour ( ccdddddd )
					Position ( -1.0 1.3 5.16 )
					Azimuth ( 0.0 0.0 5.0 )
					Transition ( 0 )
					Radius ( 0.5 )
					Elevation ( 0 0 0 )							
					)
				)
			)
		)
	
Comment( ******* Miscellaneous Wagon Information************ )

Comment (Passenger View)	
	Inside (
        PassengerCabinFile ( MCLW_B17_61665.s )
        PassengerCabinHeadPos ( 1.423 3.0 -3.5 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)
Sound (	"..\\..\\Common.Steam\\A3Sound\\B17eng.sms" )
)

Engine ( OR-61665

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)
			WhistleFX
			(
				0 3.9 -4.2
				0 1 0.25
				0.1
			)

			SafetyValvesFX
			(
				0 3.85 -3.125
				0 1 0
				0.22
			)

			StackFX
			(
				0 4.0 3.5
				0 1 0
				0.22
			)

			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-0.4 -1 -0.2
				0.05
			)
			
			Injectors2FX
			(
				-1.2 1.0 -5.4
				0 -1 0
				0.12
			)
			Injectors1FX
			(
				1.2 1.0 -5.4
				0 -1 0
				0.12
			)

			CylindersFX
			(
				-1.15 0.43 5.1
				0 0 1
				0.16
			)

			CylindersFX
			(
				1.15 0.43 5.1
				0 0 1
				0.16
			)
  )
)

Wagon ( OR-61665 )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 40in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 54.45t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 220ft^3 )  
ORTSEvaporationArea ( 1661ft^2 )
ORTSSuperheatArea ( 344ft^2 )
MaxBoilerPressure ( 225psi )
MaxSteamHeatingPressure ( 70psi )

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 3 )
CylinderStroke ( 26in ) 
CylinderDiameter ( 17.5in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13700btu/lb )
ORTSGrateArea ( 27.9ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ****************** Fuel ************************* )

MaxTenderCoalMass ( 7t-uk )
MaxTenderWaterMass ( 42000lb )
IsTenderRequired( 1 )	

ORTSWaterScoopFillElevation ( 2.8m )
ORTSWaterScoopDepth ( 3.0in ) Comment (* LNER standard scoop - depth varies depending on trough and area of operation *)
ORTSWaterScoopWidth ( 10.875in )


Comment(       ********ADVANCED PARAMETERS**********      )

Comment(ORTSMaxIndicatedHorsepower ( 1360.0hp ))   

ORTSMaxSuperheatTemperature ( 250.0 )   

ORTSBoilerEfficiency( 0.0 0.92  170.0 0.46 )   
Comment(From Report)

ORTSBurnRate( 0.0 10.0   12000.0 1430.0   14000.0 1725.0   18000.0 2350.0   22000.0 3110.0   26000.0 4030.0   30000.0 5270.0   31000.0 5760.0  33000.0 8640 )   
Comment(From Report)

    
Comment ( ****************Brake System ******************** )   

BrakesTrainBrakeType( "Vacuum_single_pipe" )
ORTSBrakePipeTimeFactor ( 0.03s )
TrainPipeLeakRate ( 0.03inHg/s )


Comment ( *** Ejectors *** )
Comment (* Estimate for Davies & Metcalfe Type VB ejector *)
VacuumBrakesHasVacuumPump ( 0 )
ORTSBrakePipeChargingRate ( 0.32inHg/s )
VacuumBrakesLargeEjectorUsageRate ( 600lb/h )
VacuumBrakesSmallEjectorUsageRate ( 240lb/h )
VacuumBrakesMinBoilerPressureMaxVacuum ( 90psi )


Comment ( *** Train Brake Valve *** )
TrainBrakesControllerMaxSystemPressure ( 21inHg )
ORTSBrakeEmergencyTimeFactor ( 5s )
ORTSBrakePipeTimeFactor ( 0.02s )
ORTSBrakeServiceTimeFactor ( 10.0s )


Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
          Notch(0    0 TrainBrakesControllerReleaseStart )
          Notch(0.1  0 TrainBrakesControllerRunningStart )
          Notch(0.2  1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )

ORTSSmallEjector ( 0 1 0.1 0.55 NumNotches ( 0 ) )


FireDoor ( 0 1 0.1 0
	NumNotches ( 0 ))
Sanding( 0 1 0 )
Blower ( 0 1 0.025 0.2
	NumNotches ( 0 ))
Shovel ( 0 1 0.1 0
	NumNotches ( 0 ))
DampersFront ( 0 1 0.1 1
	NumNotches ( 0 ))
DampersBack ( 0 1 0.1 0
	NumNotches ( 0 ))
ORTSSteamHeat( 0 1 0.0125 0.5 )
Injector1Steam ( 0 1 0 )
Injector2Steam ( 0 1 0 )
Injector1Water ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector2Water ( 0 1 0.1 0
	NumNotches ( 0 ))
CylinderCocks ( 0 1 1 )
Whistle ( 0 1 0 )
WaterScoop ( 0 1 0 )
)

Comment ( ************ Miscellaneous Information ************* )   

Cabview ( B1.cvf )
HeadOut (  -1.423 3.0 -3.5 )
Sound (	"..\\..\\Common.Steam\\A3Sound\\B17cab.sms" )
Name ( "61665 B17/6 Gresley, LEICESTER CITY, TE 28.55Klbf" )
Description (
 	"The LNER B17s were mid-weight passenger engines, designed with the lowest possible axle load to allow it to be used on former Great Eastern metals.  Initially named after famous stately homes in East Anglia, the locomotives became known as the 'Sandringham' class, after the first engine of the class.  Later engines were named after football teams, and sported name plates decorated with the colours of their namesake's strip.\n\n"+ 
 	"The engines themselves were an efficient and aesthetically pleasing design by Sir Nigel Gresley, who used his conjugated 2:1 link mechanism to drive a third, inside cylinder, negating hammer-blow forces to the track and creating a very smooth-running, powerful ride.  The first of the class was built in 1928, with many examples lasting to the end of main-line steam.  Non survived into preservation.\n\n"+ 
 	"This model represents one of the fourth batch of the class, as British Railways no.61665 'Leicester city', with LNER group standard tender and with Lined BR Brunswick green livery.\n\n"+
 	"----------------------------\n\n"+
 	"Model, Textures and Cabview (c) 2008 Christopher Heighton (MorpethCurve).  See readme for more details." 
)
)